app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "hey tgere"], ["created_at", "2022-04-01 01:10:38.074250"], ["updated_at", "2022-04-01 01:10:38.074250"], ["user_id", 1]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "hey "], ["updated_at", "2022-04-01 01:24:33.683713"], ["id", 3]]